#!/usr/bin/env python3
# -*- coding:utf-8 -*- 
# Created by yaochao at 2018/4/20


import pymongo
import pymysql
from pprint import pprint
import csv

MONGO_CONF = {
    'host': '127.0.0.1',
    'port': 27017,
}
MYSQL_CONF = {
    'host': '127.0.0.1',
    'port': 3306,
    'user': 'root',
    'passwd': '',
    'db': 'work',
    'charset': 'utf8',
    'cursorclass': pymysql.cursors.DictCursor,
}

# 村子级别的行政区划编码映射字典
# village_code_map = get_village_code_map()
village_code_map = {'152222100001': '图什业图社区居委会', '152222100002': '伊和苏莫社区居委会', '152222100003': '罕乌拉社区居委会',
                    '152222100004': '巴彦社区居委会', '152222100005': '霍林郭勒社区居委会', '152222100006': '满都拉社区居委会',
                    '152222100007': '呼格吉勒社区居委会', '152222100008': '呼和社区居委会', '152222100009': '前德门社区居委会',
                    '152222100010': '铁路社区居委会', '152222100011': '布敦化社区居委会', '152222100012': '赛罕社区居委会',
                    '152222100200': '莫勒黑哈达嘎查', '152222100201': '窑艾勒嘎查', '152222100202': '王鲁嘎查',
                    '152222100203': '敖尼斯台嘎查', '152222100204': '浩特化嘎查', '152222100205': '查日顺化嘎查',
                    '152222100206': '西日道卜嘎查', '152222100207': '伊和塔拉嘎查', '152222100208': '十三马架子嘎查',
                    '152222100209': '哈日道卜嘎查', '152222100210': '草高吐嘎查', '152222100211': '海龙屯嘎查',
                    '152222100212': '准布敦化嘎查', '152222100213': '巴仁布敦化嘎查', '152222100214': '西日嘎嘎查',
                    '152222100215': '杜锡恩格热嘎查', '152222100216': '乌逊嘎查', '152222100217': '杜热本格热嘎查',
                    '152222100218': '嘎旦扎拉嘎嘎查', '152222100219': '巴彦温都尔嘎查', '152222100220': '查干敖瑞嘎查',
                    '152222100221': '罕乌拉嘎查', '152222100500': '红星林场', '152222100501': '义和塔拉林场', '152222100502': '草籽繁殖场',
                    '152222100503': '良种繁殖场', '152222100504': '翰嘎利水库生活区', '152222101001': '阿木古楞社区居委会',
                    '152222101002': '呼斯楞社区居委会', '152222101003': '吉日嘎郎社区居委会', '152222101200': '达巴音扎拉嘎嘎查',
                    '152222101201': '索根嘎查', '152222101202': '德日苏布拉格嘎查', '152222101203': '好力特格嘎查',
                    '152222101204': '哲里木嘎查', '152222101205': '巴彦温都尔嘎查', '152222101206': '查日顺扎拉嘎嘎查',
                    '152222101207': '宝日根嘎查', '152222101208': '哈旦阿拉嘎嘎查', '152222101209': '查干登吉嘎查',
                    '152222101210': '翁根海拉苏嘎查', '152222101211': '铁日很哈达嘎查', '152222101212': '扎木钦嘎查',
                    '152222101213': '格日哈达嘎查', '152222101214': '巴彦扎拉嘎嘎查', '152222101215': '额布根乌拉嘎查',
                    '152222102001': '霍林郭勒社区居委会', '152222102002': '哲里木社区居委会', '152222102200': '乌兰哈达嘎查',
                    '152222102201': '台吉艾勒嘎查', '152222102202': '和日木嘎查', '152222102203': '吐列毛杜嘎查',
                    '152222102204': '巴仁巴彦乌兰嘎查', '152222102205': '准巴彦乌兰嘎查', '152222102206': '博根扎拉嘎嘎查',
                    '152222102207': '阿贵扎拉嘎嘎查', '152222102208': '罕查干嘎查', '152222102209': '海林嘎查',
                    '152222102210': '哈日哈达嘎查', '152222102211': '元宝屯嘎查', '152222102221': '坤都冷嘎查', '152222102222': '铁特格嘎查',
                    '152222102223': '哈根阿木斯尔嘎查', '152222102224': '赛罕化嘎查', '152222102225': '兴安敖包嘎查',
                    '152222102226': '毛盖吐嘎查', '152222102227': '地宫化嘎查', '152222102228': '新艾勒嘎查',
                    '152222103001': '敖日格乐社区居委会', '152222103200': '鲜光嘎查', '152222103201': '靠山嘎查',
                    '152222103202': '杜尔基嘎查', '152222103203': '巴彦乌拉嘎查', '152222103204': '宝根吉如和嘎查',
                    '152222103205': '布拉根阿日嘎查', '152222103206': '乌兰化嘎查', '152222103207': '楚胡尔吐嘎查',
                    '152222103208': '巴彦哈拉嘎查', '152222103209': '雅玛图嘎查', '152222103210': '德勒图乌苏嘎查',
                    '152222103211': '达日罕嘎查', '152222103212': '乌苏台扎拉嘎嘎查', '152222103213': '乌兰中嘎查',
                    '152222103214': '亚门毛都嘎查', '152222103215': '双金嘎查', '152222103216': '西林化嘎查', '152222103217': '双山嘎查',
                    '152222103501': '杜尔基林场', '152222104001': '一街社区居委会', '152222104002': '二街社区居委会',
                    '152222104003': '三街社区居委会', '152222104200': '国光嘎查', '152222104201': '东风嘎查', '152222104202': '好力保召嘎查',
                    '152222104203': '呼和道卜嘎查', '152222104204': '化道卜嘎查', '152222104205': '义和道卜嘎查',
                    '152222104206': '沙木哈嘎查', '152222104207': '仓根巴达嘎查', '152222104208': '新道卜嘎查',
                    '152222104209': '高林套海嘎查', '152222104210': '巴仁太本嘎查', '152222104211': '道本恩格尔嘎查',
                    '152222104212': '丰产嘎查', '152222104213': '老公司嘎查', '152222104214': '蒙兴嘎查', '152222104215': '金祥嘎查',
                    '152222104216': '道仑淖尔嘎查', '152222104217': '新发嘎查', '152222104218': '赛罕塔拉嘎查',
                    '152222104219': '赛罕道卜嘎查', '152222104220': '呼和索格嘎查', '152222104221': '查干陶勒盖嘎查',
                    '152222105001': '呼和努图嘎社区居委会', '152222105200': '新艾勒嘎查', '152222105201': '东巴彦套海嘎查',
                    '152222105202': '召沙嘎查', '152222105203': '伊和呼热嘎查', '152222105204': '花灯嘎查', '152222105205': '查申套卜嘎查',
                    '152222105206': '南巴彦套海嘎查', '152222105207': '包日温都热嘎查', '152222105208': '好腰苏木嘎查',
                    '152222105501': '好腰苏木林场', '152222200200': '乌兰额日格嘎查', '152222200201': '温都日花嘎查',
                    '152222200202': '道仑毛杜嘎查', '152222200203': '四海嘎查', '152222200204': '海利金茫哈嘎查', '152222200205': '茫来嘎查',
                    '152222200206': '金星嘎查', '152222200207': '代钦塔拉嘎查', '152222200208': '吉力化嘎查', '152222200209': '查干诺尔嘎查',
                    '152222200210': '布日很茫哈嘎查', '152222200211': '霍林郭勒嘎查', '152222200501': '代钦塔拉林场',
                    '152222201200': '新佳木嘎查', '152222201201': '浩力保嘎查', '152222201202': '界力伯嘎查', '152222201203': '贝子府嘎查',
                    '152222201204': '三家子嘎查', '152222201205': '哈巴斯台嘎查', '152222201206': '巴彦套海嘎查',
                    '152222201207': '杰仁达巴嘎查', '152222201208': '哈日巴达嘎查', '152222201209': '准太本嘎查', '152222201210': '新发嘎查',
                    '152222201211': '阿日本格热嘎查', '152222201212': '赛音温都热嘎查', '152222201501': '种畜场',
                    '152222202200': '乌塔其嘎查', '152222202201': '巴彦高嘎查', '152222202202': '海力森嘎查', '152222202203': '图什业图嘎查',
                    '152222202204': '布里亚特嘎查', '152222202205': '哲日格勒代嘎查', '152222202206': '呼和楚鲁嘎查',
                    '152222202207': '德布特日达巴嘎查', '152222202501': '哈日努拉防火站生活区', '152222203200': '查干登基嘎查',
                    '152222203201': '二龙屯嘎查', '152222203202': '图列吐嘎查', '152222203203': '兴隆屯嘎查', '152222203204': '新丰嘎查',
                    '152222203205': '吴龙宝嘎查', '152222203206': '拉拉屯嘎查', '152222203207': '兴安嘎查', '152222203208': '巴彦敖包嘎查',
                    '152222203209': '霍林嘎查', '152222203210': '车家营子嘎查', '152222203211': '布拉格台嘎查',
                    '152222203212': '敖扎拉嘎嘎查', '152222203213': '甲哈达嘎查', '152222203214': '巴扎拉嘎嘎查',
                    '152222203215': '查干堡好嘎查', '152222204200': '大茫哈嘎查', '152222204201': '敖力伯嘎查',
                    '152222204202': '义勒力特嘎查', '152222204203': '哈吐布其嘎查', '152222204204': '大力哈日沁嘎查',
                    '152222204205': '巴彦温都尔嘎查', '152222204206': '呼木吉乐图嘎查', '152222204207': '葛根敖日都嘎查',
                    '152222205200': '查干淖尔嘎查', '152222205201': '巴力珠尔嘎查', '152222205202': '联合嘎查',
                    '152222205203': '哈吞乃苏莫嘎查', '152222205204': '巴彦淖尔嘎查', '152222205205': '广太号嘎查',
                    '152222205206': '贵力斯台嘎查', '152222205207': '巴彦塔拉嘎查', '152222205208': '双榆树嘎查', '152222400500': '一队',
                    '152222400501': '二队', '152222400502': '三队', '152222400503': '四队', '152222400504': '五队',
                    '152222400505': '六队', '152222400506': '八一分场一队', '152222400507': '八一分场二队', '152222400508': '八一分场三队',
                    '152222400509': '八一分场四队', '152222400510': '哈日努拉分场', '152222401500': '一队', '152222401501': '二队',
                    '152222401502': '三队', '152222401503': '四队', '152222401504': '五队', '152222401505': '六队',
                    '152222402001': '霍林郭勒社区居委会', '152222402002': '孟恩社区居委会', '152222402003': '兴安社区居委会',
                    '152222403498': '虚拟铜矿社区居委会'}

village_code_map_custom = {
    '152222503': {'图什业图嘎查': '152222202203'},
    '152222101': {'哈旦阿拉嘎查': '152222101208'},
    '152222402': {'孟恩套力盖银铅矿社区委员会': '152222402002'},
    '152222501': {'义勒力特嘎查': '152222204202'},
    '152222103': {'巴仁太本嘎查': '152222104210'},
    '152222201': {'赛音温都尔嘎查': '152222201212', '草高吐嘎查': '152222100210'},
    '152222102': {'查干堡好嘎查': '152222203215'},
    '152222504': {'图列吐嘎查': '152222203202'},
}

NOT_FOUND_VILLAGE_CODE = {}
def map_village_code(person):
    '''
    通过村子名称，返回新的行政区划编码
    :param person:
    :return:
    '''
    village_name = person['villageText']
    town_code = person['ehrId'][:9]
    village_code = person['ehrId'][:12]
    addrCharRegi = person['addrCharRegi']
    if village_name == None:
        NOT_FOUND_VILLAGE_CODE[addrCharRegi] = {
            'village_name': village_name,  # 原村子名称
            'village_code': village_code,  # 原村子行政区划码
            'addrCharRegi': addrCharRegi,  # 户籍所在地地址
        }
        return
    village_code_map_keys = list(village_code_map.keys())
    village_code_map_values = list(village_code_map.values())

    village_name_index = [i for i, v in enumerate(village_code_map_values) if v == village_name]

    if len(village_name_index) == 1:
        return village_code_map_keys[village_name_index[0]]
    if len(village_name_index) > 1:
        for i in village_name_index:
            new_town_code = village_code_map_keys[i][:9]
            if new_town_code == town_code:
                return village_code_map_keys[i]

    # 代码来到这就代表没找到合适的编码了
    NOT_FOUND_VILLAGE_CODE[village_code] = {
        'village_name': village_name, # 原村子名称
        'village_code': village_code, # 原村子行政区划码
        'addrCharRegi': addrCharRegi, # 户籍所在地地址
    }

def to_csv(r):
    with open('NOT_FOUND.csv', mode='w', encoding='utf-8') as f:
        writer = csv.DictWriter(f, fieldnames=['addrCharRegi', 'village_name', 'village_code'])
        writer.writerows(r)

def main():
    connect = pymysql.connect(**MYSQL_CONF)
    cursor = connect.cursor()

    client = pymongo.MongoClient(**MONGO_CONF)
    db = client.get_database('datasets')
    collection_detail = db.get_collection('xam_person_detail')
    result_cursor = collection_detail.find()
    counter = 0
    counter2 = 0
    for i in result_cursor:
        # 进行字段提取和加工
        person = i['person']

        EMPI = person['ehrId']
        XM = person['pName']
        XZZ = person['addrCharPresent']
        HJDZ = person['addrCharRegi']
        LXDH = person['telNo']

        addrcodePresent = person['ehrId']
        JTDZ1 = addrcodePresent[:2]
        JTDZ2 = addrcodePresent[:4]
        JTDZ3 = addrcodePresent[:6]
        JTDZ4 = addrcodePresent[:9]
        JTDZ5 = map_village_code(person)  # DOWN JTDZ5需要做映射 行政区划码到村子级别

        JDSQ = person['createUnit']
        JDRY = person['creator']
        JDRYMC = person['creatorName']
        JDRYID = person['creator']
        SQBM = person['createUnit']

        ZRYS = person['mainDoctorName']
        ZRYSID = person['mainDoctor']
        JDRQ = person['createDate']
        DAH = person['ehrId']
        BRDH = person['telNo']  # TODO 这里不明确
        SFZH = person['idNo']
        XB = person['sex']
        CSRQ = person['birthDate']
        LXRXM = person['contactPerson']
        LXRDH = person['contactTelNo']
        GZDW = person['workUnit']
        CZLX = person['householdFlag']
        MZ = person['nation']
        XX = person['bloodType']
        RH = person['rh']
        XL = person['eduLevel']
        ZYLB = person['occupation']

        marriage_map = {
            '1': '10',
            '2': '20',
            '3': '30',
            '4': '40',
            '5': '90',
        }
        HYZK = marriage_map[person['marriage']] if person['marriage'] else 90

        ISET = person['feaChild']
        ISYCF = person['feaGravida']
        ISLNR = 0 if person['feaOlder'] == None else 1
        ISTNB = person['feaHyperg']
        ISGXY = person['feaHypert']
        ISJSB = person['feaPsy']
        ISFJH = person['feaPtb']
        ISPKRK = int(person['feaPap'])

        # sql拼装
        sql = 'INSERT INTO zjb_grda (EMPI,XM,XZZ,HJDZ,LXDH,JTDZ1,JTDZ2,JTDZ3,JTDZ4,JTDZ5,JDSQ,JDRY,JDRYMC,JDRYID,SQBM,ZRYS,ZRYSID,JDRQ,DAH,BRDH,SFZH,XB,CSRQ,LXRXM,LXRDH,GZDW,CZLX,MZ,XX,RH,XL,ZYLB,HYZK,ISET,ISYCF,ISLNR,ISTNB,ISGXY,ISJSB,ISFJH,ISPKRK) VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)'
        cursor.execute(sql, (
            EMPI, XM, XZZ, HJDZ, LXDH, JTDZ1, JTDZ2, JTDZ3, JTDZ4, JTDZ5, JDSQ, JDRY, JDRYMC, JDRYID, SQBM, ZRYS,
            ZRYSID,
            JDRQ, DAH, BRDH, SFZH, XB, CSRQ, LXRXM, LXRDH, GZDW, CZLX, MZ, XX, RH, XL, ZYLB, HYZK, ISET, ISYCF, ISLNR,
            ISTNB, ISGXY, ISJSB, ISFJH, ISPKRK))
        # 每1000次循环，commit一次
        counter += 1
        counter2 += 1
        if counter == 1000:
            connect.commit()
            counter = 0
        # log progress..
        print(counter2, '-', XM)
    # 最后别忘提交一次，提交最后不够1000个的insert操作。
    connect.commit()


if __name__ == '__main__':
    main()
    print(NOT_FOUND_VILLAGE_CODE.keys())
    print(len(NOT_FOUND_VILLAGE_CODE.keys()))
    to_csv(NOT_FOUND_VILLAGE_CODE.values())
